Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བདག་གིས་དེར་ཡི་དགས་ལུས་ཆེ་ལ་འབར་ཞིང་ཀུན་དུ་འབར་ཏེ། ཀུན་དུ་རབ་ཏུ་འབར་ལ་མེ་ལྕེ་གཅིག་ཏུ་འབར་ཞིང་ཚིག་པ་དང་
en: Lord, I saw an anguished spirit with an enormous body that was on fire, burning all over, and covered in flames—he was nothing but a single, searing flame.

source: དེ་ཐང་ལ་མཆིས་ན། དེའི་ལས་ལས་སྐྱེས་པའི་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་སེང་གེ་དང་སྟག་དང་གཟིག་དང་དྲེད་ལ་སོགས་པ་འབྱུང་བར་འགྱུར་ཏེ།
en: When he fled to the plains, from his past actions lions, tigers, leopards, bears, and the like, all with fangs of iron, appeared.

source: དེ་དག་གལ་ཏེ་ཆབ་ཀྱི་ནང་དུ་མཆིས་ན་ནི་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་ཆུ་སྲིན་རྣམས་འབྱུང་བར་འགྱུར།
en: When he submerged himself in the water, crocodiles with fangs of iron appeared.

source: གལ་ཏེ་དེ་ནམ་མཁའ་ལ་མཆིས་ན་ནི་ལྕགས་ཀྱི་མཆུ་ཅན་གྱི་བྱ་རོག་རྣམས་དང་། ཆུན་ལག་རྣམས་འབྱུང་བར་འགྱུར་ཏེ་
en: When he fled into the sky above, woodpeckers with beaks of iron appeared.

source: དེ་དག་གིས་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་བགྱིད་དེ།
en: All these creatures tore into his flesh over and over again and fed on him.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་ཉམས་སུ་མྱོང་ནས་ཕན་ཚུན་རྒྱུག་པ་ཞིག་མཐོང་ལགས་ན།
en: This caused him extreme, excruciating, unbearable agony, and he ran all about.

source: བཙུན་པ་སེམས་ཅན་དེས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་སྡུག་བསྔལ་དེ་ལྟ་བུ་རྙེད་པར་གྱུར་ལགས།
en: “Lord, what action did this being take that ripened into his meeting with such suffering?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་སེམས་ཅན་དེ་ནི་སྡིག་པ་བྱེད་བྱེད་པ་ཡིན་ཏེ་
en: “Maudgalyāyana,” the Blessed One explained, “that being committed nonvirtuous actions over and over again.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གསུང་རབ་ལ་སེམས་དད་དེ་རབ་ཏུ་བྱུང་ནས།
en: “Maudgalyāyana, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, that being went forth in his doctrine.

source: དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ཏེ་དེས་དེར་སྦྱིན་བདག་དང་སྦྱིན་པ་པོ་མང་པོ་དག་ལ་བསྐུལ་ནས་དགེ་འདུན་དང་མཆོད་རྟེན་གྱི་ཕྱིར་བསླངས་ཏེ།
en: After that, he acted as steward for the monks, calling upon many benefactors and patrons and accepting donations on behalf of the saṅgha and the stūpa.

source: དེས་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་མ་ཐུབ་ནས་ཐམས་ཅད་ཅི་དགའ་མགུར་སྤྱད་ལ་གཞན་དག་ལ་ཡང་བྱིན་ཏེ
en: He took the donations for the saṅgha, the donations to the stūpa, their means of regular support, and the donations for the saṅgha of the four directions, and used it to indulge himself as he pleased and to make gifts of it to others.

source: དེས་དེར་དགེ་འདུན་ལས་བཅད་ནས་བདག་ཉིད་ཀྱིས་ཀྱང་ཅི་དགའ་མགུར་སྤྱད་ལ་གཞན་དག་ལ་ཡང་བྱིན་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཡི་དགས་ཀྱི་ནང་དུ་སྐྱེས་ནས།
en: This act of cutting off the saṅgha from these donations, indulging himself as he pleased, and giving them to others ripened such that he took birth among the anguished spirits,

source: དེར་ནམ་མཁའ་ལ་གནས་པ་དང་ཆུ་ལ་གནས་པ་དང་ཐང་ལ་གནས་པའི་སྲོག་ཆགས་རྣམས་ཀྱིས་བཟའ་བར་གྱུར་ཏོ། །
en: and there was devoured by the creatures that lurk in the sky, in water, and on the plains.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་ཡིད་སྐྱོ་བར་གྱུར་པ་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their grief, taught them the Dharma accordingly,

source: དེས་ན་དེར་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: and among the assembled some generated heat right where they sat.

source: ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་དང་ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་།
en: some for the enlightenment of the listeners, some for the enlightenment of the solitary buddhas,

source: དགའ་བྱེད་ཅེས་བྱ་བ་ནི།
en: The Story of Nandaka

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། ཚེ་དང་ལྡན་པ་དགའ་བྱེད་ནི་ལུགས་ཀྱིས་དུས་དུས་སུ་སེམས་ཅན་དམྱལ་བར་རྒྱུ་བར་བྱེད།
en: When the Blessed One was in Śrāvastī, it was Venerable Nandaka’s custom to wander from time to time among the hell beings,

source: དེ་དག་གིས་དེ་ཐོས་ནས་སྐྱོ་བར་འགྱུར་ལ་སྐྱོ་བར་གྱུར་ནས་ཀྱང་གོང་དུ་ཁྱད་པར་ཐོབ་པར་འགྱུར་རོ། །
en: Those who heard him were filled with sorrow, and from this sorrow they went on to achieve great things.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་དགའ་བྱེད་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་ཆས་ནས་མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེ་
en: One day Venerable Nandaka prepared himself to wander among the anguished spirits, disappeared from Śrāvastī,

source: རྒྱ་མཚོའི་འགྲམ་དུ་ཕྱིན་པ་དང་།
en: and traveled to the seashore

source: དེས་དེར་ཡི་དགས་མོ་སྒྲེན་མོར་འདུག་ལ་རང་གི་སྐྲས་ཡོག་པ་སྡོང་པོ་མེ་རེག་མ་འདྲ་ལ་དམུས་ལོང་དུ་འདུག་པ་
en: where he saw an anguished spirit that was completely naked and covered only by the hair of her head. She was covered in flames like a burning log, and completely blind.

source: དེའི་ཁ་སྣ་ནས་སྲིན་བུ་མང་པོ་བྱུང་བ་དང་དེས་དཔག་ཚད་དུ་མར་དྲི་མནམ་པས་གང་བར་བྱེད་དེ
en: Worms poured forth from her nose and mouth, and she reeked with a stench that could be smelled for many yojanas.

source: ཕན་ཚུན་རྒྱུག་ལ་དེ་གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེར་ཁྱི་སྔོ་བཀྲ་ཅན་དག་གིས་གཙེས་ནས་
en: She ran all about, but mottled blue dogs bit her wherever she went.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་སྟེ
en: This caused her dreadful suffering and extreme, excruciating, unbearable agony,

source: སྐད་པོ་ཆེ་འཐོན་པ་ཕན་ཚུན་རྒྱུག་པ་ཞིག་མཐོང་ངོ་། །
en: and she cried out loudly as she ran all about.

source: མཐོང་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་དགའ་བྱེད་ཀྱིས་བསམས་པ། སེམས་ཅན་འདིས་ལས་ཅི་ཞིག་བྱས་ཞིག་གུ་སྙམ་སྟེ།
en: Seeing her, Venerable Nandaka asked himself, “What action did this being take?”

source: དེས་བལྟས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། དགེ་སློང་མ་འཐབ་ཀྲོལ་ཅན་ཁ་ཚས་ངན་པ་ཞིག་ཏུ་གྱུར་ནས། དེས་དེར་དགེ་སློང་མ་མང་མོ་ཞིག་ལ་ཡང་དག་པ་མ་ཡིན་པའི་སྐུར་པ་བཏབ་སྟེ།
en: When he examined that being’s past lives, he saw that after going forth as a nun in the doctrine of the totally and completely awakened Buddha Kāśyapa, she was hot-tempered and quarrelsome, slandered many different nuns,

source: དེ་དག་གི་རྙེད་པའི་བར་ཆད་བྱས་པ་མཐོང་ངོ་། །
en: and created obstacles to their material well-being.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བྱེད་ཀྱིས་བསམས་པ་འདིའི་ལས་ཀྱི་འབྲས་བུ་ནི་བདག་གིས་ཀྱང་མངོན་སུམ་དུ་མཐོང་མོད་ཀྱི་འོན་ཀྱང་སྐྱེ་བོ་མང་པོ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུའོ་སྙམ་ནས
en: Venerable Nandaka thought, “Though indeed I can see her past actions clearly, still I shall ask the Blessed One about this, so that many might become disillusioned with saṃsāra.”

source: དེ་རྒྱ་མཚོའི་འགྲམ་ནས་མི་སྣང་བར་གྱུར་ཏེ་མཉན་དུ་ཡོད་པར་སོང་བ་དང་།
en: He disappeared from the seashore and traveled to Śrāvastī,

source: དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བྱེད་ཀྱིས། བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མ་ལ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེས་བསམས་པ་འདི་ནི་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཡི་དགས་ཀྱི་ལུང་བསྟན་པ་ཞུ་བའི་དུས་ཡིན་ནོ་སྙམ་ནས།
en: Then Venerable Nandaka, seeing that the Blessed One was teaching the Dharma amid a company of hundreds, thought, “Now is the time to ask the Blessed One to explain about that anguished spirit.”

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཚེ་དང་ལྡན་པ་དགའ་བྱེད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once he had taken a seat at one side, Venerable Nandaka inquired of the Blessed One,

source: བཙུན་པ་འདི་ན་བདག་གི་ལུགས་ཀྱིས་རྟག་ཏུ་དུས་དུས་སུ་སེམས་ཅན་དམྱལ་བར་རྒྱུ་བར་བགྱིད་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་བགྱིད་དུད་འགྲོའི་ནང་དུ་རྒྱུ་བར་བགྱིད་མིའི་ནང་དུ་རྒྱུ་བར་བགྱིད་ལྷའི་ནང་དུ་རྒྱུ་བར་བགྱིད་དེ།
en: “Lord, it has always been my custom to wander from time to time among the hell beings, to wander among the anguished spirits, to wander among the animals, to wander among the humans, and to wander among the gods.

source: སླར་མཆིས་ནས་ ཡི་དགས་རྣམས་ཀྱི་བཀྲེས་པ་དང་སྐོམ་པ་དང་འབར་བ་དང་བསྲེག་པ་དང་བཙོ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་རྣམས་དང་།
en: When I return I also relate to people how the anguished spirits suffer through hunger, thirst, being burned, being incinerated, being cooked, and so on;

source: རྒྱུ་དེས་ན་དེ་དག་སྐྱོ་བར་འགྱུར་ལ་དེ་ལྟར་སྐྱོ་བར་གྱུར་ནས་ཀྱང་གོང་དུ་ཁྱད་པར་ཐོབ་པར་འགྱུར་ལགས་སོ། །
en: Because of this, the people who hear me are filled with sorrow, and from this sorrow they go on to achieve great things.

source: བཙུན་པ་བདག་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་ཆས་ནས་མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེ
en: “Lord, after preparing to wander among the anguished spirits, I disappeared from Śrāvastī

source: རྒྱ་མཚོའི་འགྲམ་དུ་མཆིས་ན།
en: and stood on the seashore.

source: བཙུན་པ་བདག་གིས་དེར་ཡི་དགས་མོ་སྒྲེན་མོར་མཆིས་ལ་རང་གི་སྐྲས་ཡོག་པ་སྡོང་པོ་མེ་རེག་མ་འདྲ་ལ་དམུས་ལོང་དུ་མཆིས་པ་དེའི་ཁ་སྣ་ནས་སྲིན་བུ་མང་པོ་བྱུང་བ་དང་དེས་དཔག་ཚད་དུ་མར་དྲི་མནམ་པས་གང་བར་བགྱིད་དེ་
en: There, Lord, I saw an anguished spirit that was completely naked and covered only by the hair of her head. She was covered in flames like a burning log, and completely blind. Worms poured forth from her nose and mouth, and she reeked with a stench that could be smelled for many yojanas.

source: ཕན་ཚུན་རྒྱུག་ལ་དེ་གང་དང་གང་དུ་མཆིས་པ་དེ་དང་དེར་ཁྱི་སྔོ་བཀྲ་དག་གིས་གཙེས་ནས
en: She ran all about, but mottled blue dogs bit her wherever she went.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་སྟེ་སྐད་པོ་ཆེ་འཐོན་ལ་ཕན་ཚུན་རྒྱུག་པ་ཞིག་མཐོང་ལགས་ན།
en: This caused her dreadful suffering and extreme, excruciating, unbearable agony, and she cried out loudly as she ran all about.

source: བཙུན་པ་ཡི་དགས་མོ་དེས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་སྡུག་བསྔལ་དེ་ལྟ་བུ་རྙེད་པར་གྱུར་ལགས།
en: “Lord, what action did this anguished spirit take that ripened into her meeting with such suffering?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བྱེད་ཡི་དགས་མོ་དེ་ནི་སྡིག་པའི་ལས་བྱེད་བྱེད་པ་ཡིན་ཏེ་དེས་སྡིག་པའི་ལས་མང་དུ་བྱས་སོ། །
en: “Nandaka,” the Blessed One explained, “that anguished spirit committed nonvirtuous actions over and over again.

source: དགའ་བྱེད་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན།
en: She committed many nonvirtuous actions.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་ཚེ་བཱ་རཱ་ཎ་སཱིར་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་
en: “Nandaka, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, there lived in Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས།
en: As they enjoyed themselves and coupled,

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: one day his wife conceived.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་རིགས་དང་འཐུན་པའི་མིང་བཏགས་ཏེ་
en: At the elaborate feast celebrating her birth they named her according to their clan.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས།
en: “When she grew up she found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa,

source: དེས་ཕ་མ་ལ་གསོལ་ཏེ།
en: asked for her parents’ permission,

source: རབ་ཏུ་བྱུང་ནས་
en: and went forth.

source: དེས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ་རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བ།
en: After going forth, she studied the Tripiṭaka and became a proponent of the Dharma with all the eloquence of her wisdom and freedom.

source: གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་གྱུར་ནསདེས་སྦྱིན་བདག་དང་སྦྱིན་པ་པོ་རྣམས་ལ་བསྐུལ་ཏེ། གཙུག་ལག་ཁང་མཆོད་རྟེན་དང་བཅས་པ་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དུ་བཅུག་ནས།
en: Having acquired provisions of clothing, food, bedding, a seat, and medicines for the sick, she called upon all the benefactors and patrons to build a stūpa and a monastery associated with it that that was complete in every respect.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་མའི་དགེ་འདུན་ལ་ཕུལ་ཏེ།
en: She made offerings to the Buddha and the rest of the saṅgha of nuns.

source: དགེ་སློང་མ་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་ལས། དེ་བྱད་གཟུགས་དང་ལང་ཚོ་དང་ཆོ་རིགས་ཀྱི་རྒྱགས་པས་དྲེགས་ནས་ཚུལ་ཁྲིམས་སྲུང་མ་ནུས་ཏེ།
en: “As she went about providing for the needs of all the nuns, she became arrogant about her well-proportioned shape, youthfulness, and high caste, and was unable to maintain her moral discipline.

source: དེས་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་ཅི་དགའ་མགུར་སྤྱད་ནས་
en: Then she took all the donations for the saṅgha, the donations to the stūpa, their regular support, and the donations for the saṅgha of the four directions, and indulged herself as she pleased.

source: དགེ་སློང་མ་རྣམས་ཀྱིས་ཚོར་ཏེ། དེ་དགེ་སློང་མའི་གཙུག་ལག་ཁང་ནས་བསྐྲད་ནས་དེ་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་ཆེན་པོ་སྐྱེས་ཏེ།
en: When the nuns heard of this, they banished her from the nunnery.

source: ཁྲོ་བའི་དབང་དུ་གྱུར་ནས་སློབ་པ་དང་མི་སློབ་པའི་དགེ་སློང་མ་མང་མོ་ཞིག་ལ་ཚིག་རྩུབ་ཅིང་བརླང་བའི་ཟུག་རྔུ་དག་གིས་སྤྱོས་ཏེ།
en: “Consumed with fury and compelled by her anger, she assailed with harsh and hurtful language many nuns on the path of learning and the path of no more to learn.

source: ཁྱིམ་ཁྱིམ་དུ་ཡང་འདི་དག་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་དང་སྡིག་པའི་ཆོས་ཅན་ཡིན་ནོ་ཞེས་དེ་དག་གི་བསྔགས་པ་མ་ཡིན་པ་བརྗོད་ལ།
en: From house to house she slandered them by exclaiming, ‘These nuns violate moral discipline and are sinful!’

source: དེ་དག་གི་རྙེད་པ་དང་བཀུར་སྟི་ཡོད་པའི་བར་ཆད་ཀྱང་བྱས་སྡང་མིག་གིས་ཀྱང་བལྟས་སོ། །
en: She thus created obstacles to their material well-being, disrespected them, and looked upon them with hate.

source: དགའ་བྱེད་དེ་ཇི་སྙམ་དུ་སེམས།
en: “Nandaka, what do you think?

source: དེའི་ཚེ་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ད་ལྟར་ཡི་དགས་མོ་དེ་ཡིན་ཏེ།
en: The one who was that nun then is none other than this anguished spirit.

source: དེས་དེར་སློབ་པ་དང་མི་སློབ་པའི་དགེ་སློང་མ་རྣམས་ཀྱི་རྙེད་པ་དང་བཀུར་སྟིའི་བར་ཆད་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཡི་དགས་སུ་སྐྱེས་སོ། །
en: The act of disrespecting and creating obstacles to the material well-being of those nuns on the paths of learning and no more to learn ripened into her birth as an anguished spirit.

source: དེས་དགེ་སློང་མ་དེ་རྣམས་ལ་ཚིག་རྩུབ་ཅིང་བརླང་བའི་ཟུག་རྔུས་སྤྱོས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་ཁ་སྣ་ནས་སྲིན་བུ་མང་པོ་བྱུང་བར་གྱུར་ཏོ། །
en: The act of assailing them with harsh and hurtful language ripened into worms pouring forth from her mouth and nose.

source: དེས་ཁྱིམ་ཁྱིམ་དུ་དེ་དག་གི་བསྔགས་པ་མ་ཡིན་པ་བརྗོད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་དཔག་ཚད་དུ་མར་དྲི་མནམ་པས་གང་བར་གྱུར་ཏོ། །
en: The act of slandering them from house to house by exclaiming, ‘These nuns violate moral discipline and are sinful!’ ripened into her reeking with a stench that could be smelled for many yojanas.

source: དེས་དགེ་སློང་མ་རྣམས་ལ་སྡང་མིག་གིས་བལྟས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་དམུས་ལོང་དུ་གྱུར་ཏོ། །
en: The act of looking upon the nuns with hate ripened into her becoming completely blind.

source: དེས་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་ཅི་དགའ་མགུར་སྤྱད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་ཁྱི་སྔོ་བཀྲ་དག་གིས་བཟའ་བར་གྱུར་ཏེ་
en: The act of taking all the donations for the saṅgha, the donations to the stūpa, their regular support, and the donations for the saṅgha of the four directions and indulging herself as she pleased ripened into her being snapped at by mottled blue dogs.

source: དེས་ནི་ལས་དེ་ལྟ་བུ་བྱས་སོ། །
en: Such were the acts she committed.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་མང་པོ་དེ་དག་སྐྱོ་བ་ཆེན་པོ་སྐྱེས་ཏེ་
en: As soon as they heard this, the people gathered there welled up with grief.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་ཡིད་སྐྱོ་བར་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེདེས་ན་དེར་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: The Blessed One directly apprehended their grief, taught them the Dharma accordingly, and among the assembled some generated heat.

source: སྣག་བུ་ཞེས་བྱ་བ་ནི།
en: Chunks of Meat

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ནི་ལུགས་ཀྱིས་དུས་དུས་སུ་སེམས་ཅན་དམྱལ་བར་རྒྱུ་བར་བྱེད་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་བྱེད་དུད་འགྲོའི་ནང་དུ་རྒྱུ་བར་བྱེད་མིའི་ནང་དུ་རྒྱུ་བར་བྱེད་ལྷའི་ནང་དུ་རྒྱུ་བར་བྱེད་དེ
en: When the Blessed One was in Śrāvastī, it was Venerable Maudgalyāyana’s custom to wander from time to time among the hell beings, to wander among the anguished spirits, to wander among the animals, to wander among the humans, and to wander among the gods.

source: ཕྱིར་འོངས་ནས་ཡི་དགས་རྣམས་ཀྱི་བཀྲེས་པ་དང་སྐོམ་པ་དང་འབར་བ་དང་བསྲེག་པ་དང་བཙོ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་རྣམས་དང་
en: When he returned, he would also relate to people how the anguished spirits suffer through hunger, thirst, being burned, being incinerated, being cooked, and so on;

source: རྒྱ་མཚོའི་འགྲམ་དུ་ཕྱིན་པ་དང་དེས་དེར་ཤའི་སྣག་བུ་འདྲ་བ་ལ་གཙང་ཁང་ཕྱུར་པོ་ཙམ་ཞིག་འདུག་སྟེ།
en: and traveled to the seashore. There he saw one whose flesh was nothing but chunks of meat piled as high as a shrine hall.

source: དེ་ས་ལ་འདུག་ན་ནི་དེ་ལ་ཐོག་ཐག་ནས་སྲོག་ཆགས་ཁབ་ཀྱི་མཆུ་ཅན་ཤ་སྟག་ཟ་ཞིང་འདུག་ལ་སྲོག་ཆགས་དེ་དག་ཟ་ཆེས་པས་དེ་གལ་ཏེ་ནམ་མཁའ་ལ་འཕགས་ན་
en: When he sat on the ground, needle-beaked creatures stood and jabbed him from all sides, intent on eating him, but when he rose up toward the sky,

source: ཡང་དེའི་ལུས་ཐམས་ཅད་མེར་འབར་ཏེ
en: his entire body burst into flames.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བ་མྱོང་ཞིང་འདུག་པ་ཞིག་མཐོང་ནས།
en: This caused him dreadful suffering and extreme, excruciating, unbearable agony.

source: སེམས་ཅན་འདིས་ལས་ཅི་ཞིག་བྱས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་སྡུག་བསྔལ་འདི་ལྟ་བུ་མྱོང་བར་གྱུར་ཞིག་གུ་སྙམ་སྟེ།
en: “What action did this being take that ripened into such dreadful suffering?”

source: དེས་བལྟས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ཏེ།
en: When he examined that being’s past lives, he saw that after going forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, he had acted as steward for the monks.

source: དེས་དེར་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་གང་ཟག་གཅིག་པུས་སྤྱད་པ་དང་།
en: But then he took all the donations for the saṅgha, the donations to the stūpa, their regular support, and the donations for the saṅgha of the four directions and used them himself,

source: ཁ་ཅིག་ནི་ཉེ་དུ་རྣམས་ལ་ཡང་བྱིན།
en: gave some to his relatives,

source: ཁ་ཅིག་ནི་ཁྲོས་ནས་མེས་བསྲེགས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པ་དེས་ན་སྡུག་བསྔལ་དེ་ལྟ་བུ་དག་རྙེད་པར་གྱུར་པར་མཐོང་ངོ་། །
en: and incinerated some out of anger. These were the actions that ripened into his meeting with such suffering.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསམས་པ་འདིའི་ལས་ནི་བདག་གིས་ཀྱང་ཡང་དག་པར་མངོན་སུམ་དུ་མཐོང་མོད་ཀྱི་འོན་ཀྱང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུའོ་སྙམ་ནས
en: Venerable Mahā­maudgalyāyana thought, “Though indeed I can see his past actions clearly, still I shall ask the Blessed One about this, so that many might become disillusioned with saṃsāra.”

source: རྒྱ་མཚོའི་འགྲམ་ནས་མི་སྣང་བར་གྱུར་ཏེ་མཉན་དུ་ཡོད་པར་སོང་བ་དང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་བཞུགས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: He disappeared from the seashore and traveled to Śrāvastī, where the Blessed One sat teaching the Dharma amid a company of hundreds.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: He approached the Blessed One, touched his head to the Blessed One’s feet, and took a seat at one side.

source: བཙུན་པ་འདི་ན་བདག་གི་ལུགས་ཀྱིས་དུས་དུས་སུ་སེམས་ཅན་དམྱལ་བར་རྒྱུ་བར་བགྱིད། ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་བགྱིད། དུད་འགྲོའི་ནང་དུ་རྒྱུ་བར་བགྱིད། མིའི་ནང་དུ་རྒྱུ་བར་བགྱིད། ལྷའི་ནང་དུ་རྒྱུ་བར་བགྱིད་དེ།
en: “Lord, it is my custom to wander from time to time among the hell beings, to wander among the anguished spirits, to wander among the animals, to wander among the humans, and to wander among the gods.

source: ལྷ་རྣམས་ཀྱི་འཆི་འཕོ་དང་ལྟུང་བ་དང་རྣམ་པར་འཐོར་བ་དང་རྣམ་པར་འཇིག་པའི་སྡུག་བསྔལ་གང་ལགས་པ་དེ་དག་མི་རྣམས་ལ་རྗོད་པར་བགྱིད་དེ་རྒྱུ་དེས་ན་དེ་དག་སྐྱོ་བར་འགྱུར་ལ།
en: and how the gods suffer through dying, falling, disintegrating, and decaying. Because of this, the people who hear me are filled with sorrow,

source: བཙུན་པ་བདག་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་ཆས་ནས་མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེརྒྱ་མཚོའི་འགྲམ་དུ་མཆིས་ན།
en: “Lord, after preparing to wander among the anguished spirits, I disappeared from Śrāvastī and traveled to the seashore,

source: བཙུན་པ་བདག་གིས་དེར་སེམས་ཅན་ཤའི་སྣག་བུ་འདྲ་བ་ལ་གཙང་ཁང་ཕྱུར་པོ་ཙམ་ཞིག་མཆིས་ཏེ་
en: Lord, where I saw one whose flesh was nothing but chunks of meat piled as high as a shrine hall.

source: དེ་ས་ལ་མཆིས་ན་ནི། དེ་ལ་ཐོག་ཐག་ནས་སྲོག་ཆགས་ཁབ་ཀྱི་མཆུ་ཅན་ཤ་སྟག་འཚལ་ཞིང་མཆིས་ལ། སྲོག་ཆགས་དེ་དག་འཚལ་ཆེས་པས་
en: When he sat on the ground, needle-beaked creatures stood and jabbed him from all sides, intent on eating him.

source: དེ་གལ་ཏེ་ནམ་མཁའ་ལ་འཕགས་ན་ཡང་། དེའི་ལུས་ཐམས་ཅད་ཞུགས་སུ་འབར་ཏེ
en: But when he rose up toward the sky, his entire body burst into flames.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བ་མྱོང་ཞིང་མཆིས་པ་ཞིག་མཐོང་ལགས་ན།
en: This caused him dreadful suffering and extreme, excruciating, unbearable agony.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་སེམས་ཅན་དེ་ནི་སྡིག་པའི་ལས་བྱེད་བྱེད་པ་ཡིན་ཏེ་
en: “Maudgalyāyana,” the Blessed One explained, “that being committed nonvirtuous actions over and over again.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་སེམས་ཅན་དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ནས།
en: “Maudgalyāyana, in times gone by, after going forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, that being acted as steward for the monks.

source: དེས་དེར་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་གང་ཟག་གཅིག་པུས་སྤྱད་ལ། ཁ་ཅིག་ནི་བསགས་ཏེ་
en: But then he took all the donations for the saṅgha, the donations to the stūpa, their regular support, and the donations for the saṅgha of the four directions and instead enjoyed some for himself and hoarded the rest.

source: བཞག་པ་ལས་དེ་ཕྱི་ཞིག་ན་ནད་ཀྱིས་ཐེབས་ནས་དེས་ནོར་དེ་དག་ཉེ་དུ་རྣམས་ལ་སྦྱིན་པར་བྱས་པ་དང་།
en: One day, having fallen ill, he handed the riches over to his relatives.

source: དེ་དགེ་སློང་དག་གིས་མཐོང་ནས་བཀག་པ་ལས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The monks saw this and put a stop to it, so he thought,

source: གལ་ཏེ་འདི་དག་གིས་བཀག་པ་ལྟ་ན། བདག་གིས་ཅི་ནས་དེ་དག་ལ་ཡང་མི་ཕན་ལ་བདག་ལ་ཡང་མི་ཕན་པར་བྱའོ་སྙམ་མོ། །
en: ‘If they’re trying to stop me, then at the very least I shall make it so that none of us will benefit!’

source: དེ་ནས་དེ་ཁྲོས་པས་ནོར་དེ་དག་ཐམས་ཅད་མེས་བསྲེགས་སོ། །
en: Then in anger he set all the riches on fire.

source: དེའི་འོག་ཏུ་དེ་དེ་ནས་ཤི་འཕོས་ཏེ་ཤི་ནས་ཡི་དགས་སུ་སྐྱེས་ཏེ།
en: “After that he died from there and transmigrated, taking rebirth as an anguished spirit.
